app/Controllers/Campagne.php

    public function dashboard($idClient)
    {
        //Test pour voir si le compte est admin aucun traitement
        $user = auth()->user();
        if (!$user->inGroup('admin')) {
            $idUser = auth()->id();
            $idClientUser = $this->clientModel->findClientIdByUserId($idUser);

            //Test pour voir si le compte tente d'acceder a d'autre page que les siens (sécurité du site)
            //Renvoie vers leur gestion campagne
            if (!($idClientUser['ID_CLIENT'] == $idClient)) {
                return redirect()->to("gestion-campagnes/{$idClientUser['ID_CLIENT']}");
            }
        }
        //Renvoie les information de la campagne Titre,id...
        $campagne = $this->campagneModel->findCampagnesDetailsByClientId($idClient);
---
SELECT *
FROM `client`
WHERE `client`.`ID_CLIENT` = '26'

    public function ajout($idClient)
    {
        $user = auth()->user();

        if (!$user->inGroup('admin')) {
            $idUser = auth()->id();
            $idClientUser = $this->clientModel->findClientIdByUserId($idUser);
---
SELECT *
FROM `client`
WHERE `client`.`ID_CLIENT` = '26'