app/Controllers/Client.php

    public function gestionclient()
    {

        /* ------------------------ test de la methode admin ------------------------ */
        /*test si utilisateur est admin                                               */
        /*si il est admin il va aller vers le dashboard                               */
        /*sinon il va aller vers la gestion des clients                               */
        /*si il est connecte mais pas admin il va aller                               */
        /*vers le dashboard des campagne associé au client                            */
        /* ---------------------------------------------------------------------------*/

        $user = auth()->user();

        if (!$user->inGroup('admin')) {
            $user_id = auth()->id();

            $idClient = $this->clientModel->findClientIdByUserId($user_id);

            return redirect()->to("gestion-campagnes/{$idClient['ID_CLIENT']}");
        }
        $client = $this->clientModel->findAll();
---
SELECT *
FROM `client`

    public function ajout()
    {
        $user = auth()->user();
        if (!$user->inGroup('admin')) {
            $user_id = auth()->id();

            $idClient = $this->clientModel->findClientIdByUserId($user_id);

            return redirect()->to("gestion-campagnes/{$idClient['ID_CLIENT']}");
        }

        $listeUser = $this->userModel->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    public function create()
    {
        $user = auth()->user();
        if (!$user->inGroup('admin')) {
            $user_id = auth()->id();

            $idClient = $this->clientModel->findClientIdByUserId($user_id);

            return redirect()->to("gestion-campagnes/{$idClient['ID_CLIENT']}");
        }
        $data = $this->request->getPost();
        $this->clientModel->insert($data);
---
INSERT INTO `client` (`ID_UTILISATEUR`, `RAISON_SOCIALE`, `NOM`, `PRENOM`, `EMAIL`, `TELEPHONE`, `ADRESSE`, `CODE_POSTAL`, `VILLE`) VALUES ('9', 'gerhegeqrg', 'déchu', 'le', 'germain@gmail.com', '0784260033', '140 Chemin de Marcette', '82440', 'Réalville')

    public function delete($idClient)
    {
        $user = auth()->user();
        if (!$user->inGroup('admin')) {
            $user_id = auth()->id();

            $idClient = $this->clientModel->findClientIdByUserId($user_id);

            return redirect()->to("gestion-campagnes/{$idClient['ID_CLIENT']}");
        }
        $this->db->transStart();
        $clientIdSup = $this->clientModel->find($idClient);
        $idUserSup = $clientIdSup['ID_UTILISATEUR'];

        $this->userModel->delete($idUserSup);
        $idCampagne = $this->campagneModel->findCampagnesByClientId($idClient);
        if ($idCampagne) {
            foreach ($idCampagne as $campagne) {
                $this->questionModel->deleteQuestionsByCampagneId($campagne['ID_CAMPAGNE']);
            }
            $this->campagneModel->deleteByClientId($idClient);
        }
        $this->clientModel->delete($idClient);
---
SELECT *
FROM `client`
WHERE `client`.`ID_CLIENT` = '26'
UPDATE `users` SET `deleted_at` = '2025-04-29 09:32:43', `updated_at` = '2025-04-29 09:32:43'
WHERE `id` IN ('9')
AND `deleted_at` IS NULL
DELETE FROM `client`
WHERE `ID_CLIENT` IN ('26')