app/Models/Campagne.php

    public function deleteCampaignsAndQuestionsByClientId($clientId)
    {


        // Récupérer les IDs des campagnes
        $campagne_ids = $this->select('ID_CAMPAGNE')
        ->where('ID_CLIENT', $clientId)->findAll();
---
SELECT `ID_CAMPAGNE`
FROM `campagne`
WHERE `ID_CLIENT` = '26'

    public function findIDClient($ID_CLIENT)
    {
        return $this
            ->select('ID_CLIENT, TITRE, ID_CAMPAGNE')
            ->where('ID_CLIENT', $ID_CLIENT)
            ->findAll();
---
SELECT `ID_CLIENT`, `TITRE`, `ID_CAMPAGNE`
FROM `campagne`
WHERE `ID_CLIENT` = '26'